package studyclass;

public class study9 {

	public static void main(String[] args) {

		//클래스-클래스란 객체를 정의해 놓은것
		//클래스의 용도- 클래스는 객체를 생성하는데 사용
		//객체의 정의 실제로 존재하는것, 사물 또는 개념
		//객체의 용도 객체가 가지고 있는 기능과 속성에 따라 다름
		//속성-크기 길이 높이 색상 볼륨 채널-변수--String color; boolean power;(tv설계도)
		
		//기능-켜기 끄기 볼륨 높이기 볼륨낯추기 채널변경하기 (메소드)  void power(),void channelup()
		
		//객체-      모든 인스턴스를 대료하는 일반적 용어
		//인스턴스-   특정 클래스로부터 생성된 객체
		
		//클래스--설계도
		//인스턴스(객체)--제품
		
		//클래스가 왜필요한가--객체를 생성하기 위해
		//객체가 왜 필요한가--객체를 사용하기 위해
		//객체를 사용한다는 것은--객체가 가진 속성과 기능을 사용하려고
		
		//public 클래스와 이름은 일치해야한다.
		//클래스명 변수명; ---클래스의 객체를 참조하기 위한 참조변수를 선언
		//변수명 = new 클래스명();--클래스의 객체를 생성후 객체의 주소를 참조변수에 저장
		// Tv t = new Tv() -- tv클래스 타임의 참조변수 t를선언--- tv인스턴스를 생성한 후 생성된 tv인스턴스의 주소를 t에 저장
		//객체의 사용 -- t.channel = 7;    --------tv인스턴스의 멤버변수 channel의 값을 7로 한다.
		//t.channelDown();    ----------tv인스턴스의 메서드 channelDown()호출한다.
		//system.out.println("현재 채널은 " + t.channel + "입니다."); 
		
		//클래스 작성 --객체생성 -- 객체사용 순이다.
		
		
		
		
		
		
		
		
		
		
		
	}

}
